Core/src/src/Documents/КадровоеПеремещение/КадровоеПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КадровоеПеремещение</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ДниОтпускаСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияИУдержания</registerRecords>
  <registerRecords>InformationRegister.ДругиеВидыОтсутствия</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКадровоеПеремещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОтпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОтпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗанимаемыхСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчастникПенсионногоФонда</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>УчаствуетДобровольно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyDivision</name>
      <type>
        <types>CatalogRef.AzRyDivision</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДоговора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтпуска</name>
      <type>
        <types>CatalogRef.ВидыОтпусков</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленияУдержания</name>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>Актуальность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НалогиНаДоходы</name>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Актуальность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Enums/ВидыОперацийКадровоеПеремещение/ВидыОперацийКадровоеПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКадровоеПеремещение</name>
  <enumValues>
    <name>ПеремещениеИИзменениеСпособаОплаты</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСпособаОплаты</name>
  </enumValues>
  <enumValues>
    <name>СписаниеДнейОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ВидыОтпусков</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Documents/КадровоеПеремещение/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаКадровоеПеремещение, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	КадровоеПеремещениеСотрудники.НомерСтроки КАК НомерСтроки,
	|	КадровоеПеремещениеСотрудники.Сотрудник КАК Сотрудник,
	|	КадровоеПеремещениеСотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	КадровоеПеремещениеСотрудники.Должность КАК Должность,
	|	КадровоеПеремещениеСотрудники.ГрафикРаботы КАК ГрафикРаботы,
	|	КадровоеПеремещениеСотрудники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	КадровоеПеремещениеСотрудники.Период КАК Период,
	|	КадровоеПеремещениеСотрудники.КлючСвязи КАК КлючСвязи,
	|	КадровоеПеремещениеСотрудники.УчастникПенсионногоФонда КАК УчастникПенсионногоФонда,
	|	КадровоеПеремещениеСотрудники.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	КадровоеПеремещениеСотрудники.УчаствуетДобровольно КАК УчаствуетДобровольно,
	|	КадровоеПеремещениеСотрудники.Ссылка КАК Ссылка,
	|	КадровоеПеремещениеСотрудники.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
	|	КадровоеПеремещениеСотрудники.ВидОтпуска КАК ВидОтпуска,
	|	КадровоеПеремещениеСотрудники.КоличествоДней КАК КоличествоДней,
	|	КадровоеПеремещениеСотрудники.Ссылка.Дата КАК Дата  
	|,	КадровоеПеремещениеСотрудники.Ссылка.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ТаблицаСотрудники
	|ИЗ
	|	Документ.КадровоеПеремещение.Сотрудники КАК КадровоеПеремещениеСотрудники
	|ГДЕ
	|	КадровоеПеремещениеСотрудники.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	КадровоеПеремещениеСотрудники.НомерСтроки КАК НомерСтроки,
	|	КадровоеПеремещениеСотрудники.Сотрудник КАК Сотрудник,
	|	КадровоеПеремещениеСотрудники.Период КАК Период,
	|	КадровоеПеремещениеНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	КадровоеПеремещениеНачисленияУдержания.Валюта КАК Валюта,
	|	КадровоеПеремещениеНачисленияУдержания.Сумма КАК Сумма,
	|	КадровоеПеремещениеНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	КадровоеПеремещениеНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
	|	КадровоеПеремещениеНачисленияУдержания.Актуальность КАК Актуальность,
	|	КадровоеПеремещениеСотрудники.ВидОтпуска КАК ВидОтпуска,
	|	КадровоеПеремещениеСотрудники.КоличествоДней КАК КоличествоДней
	|ПОМЕСТИТЬ ТаблицаНачисленияУдержания
	|ИЗ
	|	Документ.КадровоеПеремещение.Сотрудники КАК КадровоеПеремещениеСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещение.НачисленияУдержания КАК КадровоеПеремещениеНачисленияУдержания
	|		ПО КадровоеПеремещениеСотрудники.КлючСвязи = КадровоеПеремещениеНачисленияУдержания.КлючСвязи
	|ГДЕ
	|	КадровоеПеремещениеСотрудники.Ссылка = &Ссылка
	|	И КадровоеПеремещениеНачисленияУдержания.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	КадровоеПеремещениеСотрудники.НомерСтроки,
	|	КадровоеПеремещениеСотрудники.Сотрудник,
	|	КадровоеПеремещениеСотрудники.Период,
	|	КадровоеПеремещениеНалогиНаДоходы.ВидНачисленияУдержания,
	|	КадровоеПеремещениеНалогиНаДоходы.Валюта,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	КадровоеПеремещениеНалогиНаДоходы.Актуальность,
	|	КадровоеПеремещениеСотрудники.ВидОтпуска,
	|	КадровоеПеремещениеСотрудники.КоличествоДней
	|ИЗ
	|	Документ.КадровоеПеремещение.Сотрудники КАК КадровоеПеремещениеСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещение.НалогиНаДоходы КАК КадровоеПеремещениеНалогиНаДоходы
	|		ПО КадровоеПеремещениеСотрудники.КлючСвязи = КадровоеПеремещениеНалогиНаДоходы.КлючСвязи
	|ГДЕ
	|	КадровоеПеремещениеСотрудники.Ссылка = &Ссылка
	|	И КадровоеПеремещениеНалогиНаДоходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КадровоеПеремещениеНалогиНаДоходы.КлючСвязи КАК КлючСвязи,
	|	МАКСИМУМ(КадровоеПеремещениеНалогиНаДоходы.ВидНачисленияУдержания) КАК ВидУдержанияНДФЛ
	|ПОМЕСТИТЬ ТаблицаСтавкиНДФЛ
	|ИЗ
	|	Документ.КадровоеПеремещение.НалогиНаДоходы КАК КадровоеПеремещениеНалогиНаДоходы
	|ГДЕ
	|	КадровоеПеремещениеНалогиНаДоходы.Ссылка = &Ссылка
	|	И КадровоеПеремещениеНалогиНаДоходы.Актуальность
	|
	|СГРУППИРОВАТЬ ПО
	|	КадровоеПеремещениеНалогиНаДоходы.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудники.Организация КАК Организация,
	|	ТаблицаСотрудники.НомерСтроки КАК НомерСтроки,
	|	ТаблицаСотрудники.Сотрудник КАК Сотрудник,
	|	ТаблицаСотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаСотрудники.Должность КАК Должность,
	|	ТаблицаСотрудники.ГрафикРаботы КАК ГрафикРаботы,
	|	ТаблицаСотрудники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ЕСТЬNULL(ТаблицаСтавкиНДФЛ.ВидУдержанияНДФЛ, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)) КАК ВидУдержанияНДФЛ,
	|	ТаблицаСотрудники.УчастникПенсионногоФонда КАК УчастникПенсионногоФонда,
	|	ТаблицаСотрудники.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ТаблицаСотрудники.УчаствуетДобровольно КАК УчаствуетДобровольно,
	|	ТаблицаСотрудники.Период КАК Период,
	|	ТаблицаСотрудники.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
	|	ВЫБОР
	|		КОГДА ТаблицаСотрудники.ВидОтпуска = ЗНАЧЕНИЕ(Справочник.ВидыОтпусков.ПустаяСсылка)
	|			ТОГДА СотрудникиСрезПоследних.ВидОтпуска
	|		ИНАЧЕ ТаблицаСотрудники.ВидОтпуска
	|	КОНЕЦ КАК ВидОтпуска,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаСотрудники.КоличествоДней, 0) = 0
	|			ТОГДА СотрудникиСрезПоследних.КоличествоДнейОтпуска
	|		ИНАЧЕ ТаблицаСотрудники.КоличествоДней
	|	КОНЕЦ КАК КоличествоДнейОтпуска
	|ИЗ
	|	ТаблицаСотрудники КАК ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСтавкиНДФЛ КАК ТаблицаСтавкиНДФЛ
	|		ПО ТаблицаСотрудники.КлючСвязи = ТаблицаСтавкиНДФЛ.КлючСвязи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(
	|				&ДатаСрееза,
	|				(Организация, Сотрудник) В
	|					(ВЫБРАТЬ
	|						а.Организация,
	|						а.Сотрудник
	|					ИЗ
	|						ТаблицаСотрудники КАК а)) КАК СотрудникиСрезПоследних
	|		ПО ТаблицаСотрудники.Организация = СотрудникиСрезПоследних.Организация
	|			И ТаблицаСотрудники.Сотрудник = СотрудникиСрезПоследних.Сотрудник
	|ГДЕ
	|	ТаблицаСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачисленияУдержания.Организация КАК Организация,
	|	ТаблицаНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	ТаблицаНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	ТаблицаНачисленияУдержания.Период КАК Период,
	|	ТаблицаНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ТаблицаНачисленияУдержания.Валюта КАК Валюта,
	|	ТаблицаНачисленияУдержания.Сумма КАК Сумма,
	|	ТаблицаНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ТаблицаНачисленияУдержания.Актуальность КАК Актуальность
	|ИЗ
	|	ТаблицаНачисленияУдержания КАК ТаблицаНачисленияУдержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаСотрудники.Организация КАК Организация,
	|	ТаблицаСотрудники.НомерСтроки КАК НомерСтроки,
	|	ТаблицаСотрудники.Сотрудник КАК Сотрудник,  
	|	ТаблицаСотрудники.Подразделение КАК СтруктурнаяЕдиница,
	|	ТаблицаСотрудники.Дата КАК Период,
	|	ТаблицаСотрудники.ВидОтпуска КАК ВидНачисленияОтпуска,
	|	ТаблицаСотрудники.КоличествоДней КАК КоличествоДней
	|ИЗ
	|	ТаблицаСотрудники КАК ТаблицаСотрудники
	|ГДЕ
	|	ТаблицаСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКадровоеПеремещение.СписаниеДнейОтпуска)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Период КАК Период,
	|	ТаблицаСотрудники.Ссылка КАК Регистратор,
	|	ТаблицаСотрудники.НомерСтроки КАК НомерСтроки,
	|	СотрудникиСрезПоследних.Активность КАК Активность,
	|	ТаблицаСотрудники.Организация КАК Организация,
	|	ТаблицаСотрудники.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.Должность КАК Должность,
	|	СотрудникиСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	|	СотрудникиСрезПоследних.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
	|	СотрудникиСрезПоследних.УчастникПенсионногоФонда КАК УчастникПенсионногоФонда,
	|	СотрудникиСрезПоследних.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	СотрудникиСрезПоследних.УчаствуетДобровольно КАК УчаствуетДобровольно,
	|	ТаблицаСотрудники.ВидОтпуска КАК ВидОтпуска,
	|	ТаблицаСотрудники.КоличествоДней КАК КоличествоДнейОтпуска
	|ИЗ
	|	ТаблицаСотрудники КАК ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(
	|				&ДатаСрееза,
	|				(Организация, Сотрудник) В
	|					(ВЫБРАТЬ
	|						а.Организация,
	|						а.Сотрудник
	|					ИЗ
	|						ТаблицаСотрудники КАК а)) КАК СотрудникиСрезПоследних
	|		ПО ТаблицаСотрудники.Организация = СотрудникиСрезПоследних.Организация
	|			И ТаблицаСотрудники.Сотрудник = СотрудникиСрезПоследних.Сотрудник
	|ГДЕ
	|	ТаблицаСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКадровоеПеремещение.ВидыОтпусков)");
	//--- Дмгг Таск ONESOFT-2766 08.12.22
	                
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКадровоеПеремещение);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ДатаСрееза", НачалоДня(ДокументСсылкаКадровоеПеремещение.Дата) - 1);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСотрудники", 				МассивРезультатов[3].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлановыеНачисленияИУдержания", МассивРезультатов[4].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДниОтпускаСотрудников", МассивРезультатов[5].Выгрузить());
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСотрудники", МассивРезультатов[6].Выгрузить());
	
	СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтерфейсПечати

Процедура СформироватьКадровыйПриказ(ОписаниеПечатнойФормы, МассивОбъектов, ОбъектыПечати) Экспорт
	Перем Ошибки, ПервыйДокумент, НомерСтрокиНачало;
	
	Макет				= УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
	ТабличныйДокумент	= ОписаниеПечатнойФормы.ТабличныйДокумент;
	ДанныеПечати		= Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
	"Выбрать
	|	ОбщиеСведенияОПеремещении.Ссылка
	|	,ОбщиеСведенияОПеремещении.Номер
	|	,ОбщиеСведенияОПеремещении.Дата КАК ДатаДокумента
	|	,ОбщиеСведенияОПеремещении.Организация КАК Организация
	|	,ОбщиеСведенияОПеремещении.Организация.Префикс КАК Префикс
	|	,ОбщиеСведенияОПеремещении.Организация.КодПоОКПО КАК КодПоОКПО
	|	,ОбщиеСведенияОПеремещении.ПодписьРуководителя.Должность КАК ДолжностьРуководителя
	|	,ОбщиеСведенияОПеремещении.ПодписьРуководителя.РасшифровкаПодписи КАК РуководительРасшифровкаПодписи
	|Из Документ.КадровоеПеремещение КАК ОбщиеСведенияОПеремещении
	|Где ОбщиеСведенияОПеремещении.Ссылка В(&МассивОбъектов)
	|
	|;Выбрать
	|	СведенияОСотруникеПрошлогоПериода.Сотрудник КАК Сотрудник 
	|	,СведенияОСотруникеПрошлогоПериода.Организация КАК Организация
	|	,Максимум(СведенияОСотруникеПрошлогоПериода.Период) КАК ПериодПредыдущейЗаписи
	|Поместить ПериодыПредыдущихЗаписей
	|Из Документ.КадровоеПеремещение.Сотрудники КАК СведенияОСотрудниках
	|	Левое соединение РегистрСведений.Сотрудники КАК СведенияОСотруникеПрошлогоПериода
	|	По СведенияОСотрудниках.Ссылка.Организация = СведенияОСотруникеПрошлогоПериода.Организация
	|	И СведенияОСотрудниках.Сотрудник = СведенияОСотруникеПрошлогоПериода.Сотрудник
	|	И СведенияОСотрудниках.Период > СведенияОСотруникеПрошлогоПериода.Период
	|Где СведенияОСотрудниках.Ссылка В(&МассивОбъектов)
	|Сгруппировать по СведенияОСотруникеПрошлогоПериода.Сотрудник, СведенияОСотруникеПрошлогоПериода.Организация
	|
	|;Выбрать
	|	СведенияОСотрудниках.КлючСвязи КАК КлючСвязи
	|	,СведенияОСотрудниках.Период КАК ДатаПеревода
	|	,""постоянно"" КАК ВидПеревода
	|	,СведенияОСотрудниках.Сотрудник.Наименование КАК Работник
	|	,СведенияОСотрудниках.Сотрудник.Код КАК ТабельныйНомер
	|	,СведенияОСотруникеПрошлогоПериода.СтруктурнаяЕдиница КАК ПодразделениеПредыдущее
	|	,СведенияОСотруникеПрошлогоПериода.Должность.Наименование КАК ДолжностьПредыдущаяя
	|	,СведенияОСотрудниках.СтруктурнаяЕдиница КАК ПодразделениеНовое
	|	,СведенияОСотрудниках.Должность.Наименование КАК ДолжностьНовая
	|Из Документ.КадровоеПеремещение.Сотрудники КАК СведенияОСотрудниках
	|	Левое Соединение ПериодыПредыдущихЗаписей КАК ПериодыПредыдущихЗаписей
	|	По СведенияОСотрудниках.Ссылка.Организация = ПериодыПредыдущихЗаписей.Организация
	|		И СведенияОСотрудниках.Сотрудник = ПериодыПредыдущихЗаписей.Сотрудник
	|	Левое Соединение РегистрСведений.Сотрудники КАК СведенияОСотруникеПрошлогоПериода
	|	По СведенияОСотрудниках.Ссылка.Организация = СведенияОСотруникеПрошлогоПериода.Организация
	|		И СведенияОСотрудниках.Сотрудник = СведенияОСотруникеПрошлогоПериода.Сотрудник
	|		И ПериодыПредыдущихЗаписей.ПериодПредыдущейЗаписи = СведенияОСотруникеПрошлогоПериода.Период
	|Где СведенияОСотрудниках.Ссылка В(&МассивОбъектов)
	|
	|;Выбрать
	|	СведенияОНачислениях.КлючСвязи КАК КлючСвязи
	|	,СведенияОНачислениях.Сумма КАК СуммаНачисления
	|	,ВидНачисленияУдержания.Наименование КАК ПредставлениеНачисления
	|Из Документ.КадровоеПеремещение.НачисленияУдержания КАК СведенияОНачислениях
	|Где СведенияОНачислениях.Ссылка В(&МассивОбъектов)
	|	И СведенияОНачислениях.ВидНачисленияУдержания.Тип = Значение(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|Упорядочить по СведенияОНачислениях.НомерСтроки";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ОбщиеСведенияОПриеме = РезультатЗапроса[0].Выгрузить();
	СведенияОСотрудниках = РезультатЗапроса[2].Выгрузить();
	СведенияОНачислениях = РезультатЗапроса[3].Выгрузить();
	
	Для каждого ДанныеСотрудника Из СведенияОСотрудниках Цикл
		
		ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало, ДанныеПечати);
		
		СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ОбщиеСведенияОПриеме[0].Организация, ОбщиеСведенияОПриеме[0].ДатаДокумента, ,);
		ДанныеПечати.Вставить("НазваниеОрганизации", УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование"));
		ДанныеПечати.Вставить("КодПоОКПО", ОбщиеСведенияОПриеме[0].КодПоОКПО);
		ДанныеПечати.Вставить("НомерДокумента", ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ОбщиеСведенияОПриеме[0].ДатаДокумента, ОбщиеСведенияОПриеме[0].Номер, ОбщиеСведенияОПриеме[0].Префикс));
		ДанныеПечати.Вставить("ДатаДокумента", ОбщиеСведенияОПриеме[0].ДатаДокумента);
		
		ДанныеПечати.Вставить("ДатаНачала", ДанныеСотрудника.ДатаПеревода);
		ДанныеПечати.Вставить("ДатаОкончания", Неопределено);
		ДанныеПечати.Вставить("Работник", ДанныеСотрудника.Работник);
		ДанныеПечати.Вставить("ТабельныйНомер", ДанныеСотрудника.ТабельныйНомер);
		ДанныеПечати.Вставить("ВидПеревода", ДанныеСотрудника.ВидПеревода);
		ДанныеПечати.Вставить("ПодразделениеПредыдущее", ДанныеСотрудника.ПодразделениеПредыдущее);
		ДанныеПечати.Вставить("ДолжностьПредыдущаяя", ДанныеСотрудника.ДолжностьПредыдущаяя);
		ДанныеПечати.Вставить("ПодразделениеНовое", ДанныеСотрудника.ПодразделениеНовое);
		ДанныеПечати.Вставить("ДолжностьНовая", ДанныеСотрудника.ДолжностьНовая);
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("КлючСвязи", ДанныеСотрудника.КлючСвязи);
		
		ДанныеПечати.Вставить("ОкладТарифнаяСтавкаЦелаяЧасть", Неопределено);
		ДанныеПечати.Вставить("ОкладТарифнаяСтавкаДробнаяЧасть", Неопределено);
		ДанныеПечати.Вставить("Надбавка", Неопределено);
		ДанныеПечати.Вставить("ВалютаТарифнойСтавки", НСтр("ka='ლარი';ru='руб.';en='rub.'"));
		ДанныеПечати.Вставить("КопейкиТарифнойСтавки", НСтр("ka='ასლი';ru='коп.';en='коп.'"));
		
		ПорядковыйНомерНачисления = 0;
		
		НайденныеСтроки = СведенияОНачислениях.НайтиСтроки(СтруктураОтбора);
		Для каждого СтрокаНачисления Из НайденныеСтроки Цикл
			
			Если ПорядковыйНомерНачисления = 0 Тогда
				
				ДанныеПечати.ОкладТарифнаяСтавкаЦелаяЧасть = Цел(СтрокаНачисления.СуммаНачисления);
				ДанныеПечати.ОкладТарифнаяСтавкаДробнаяЧасть = Формат(СтрокаНачисления.СуммаНачисления - ДанныеПечати.ОкладТарифнаяСтавкаЦелаяЧасть, "ЧН=00");
				
				ПорядковыйНомерНачисления = ПорядковыйНомерНачисления + 1;
				
			ИначеЕсли ПорядковыйНомерНачисления = 1 Тогда
				
				ДанныеПечати.Надбавка  = СокрЛП(СтрокаНачисления.ПредставлениеНачисления) + ": " + Строка(СтрокаНачисления.СуммаНачисления);
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДанныеПечати.Вставить("ДолжностьРуководителя", ОбщиеСведенияОПриеме[0].ДолжностьРуководителя);
		ДанныеПечати.Вставить("РуководительРасшифровкаПодписи", ОбщиеСведенияОПриеме[0].РуководительРасшифровкаПодписи);
		
		Макет.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(Макет);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ОбщиеСведенияОПриеме[0].Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Приказ_Т5");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КадровоеПеремещение_Т5";
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.КадровоеПеремещение.ПФ_MXL_Т5";
		ПечатнаяФорма.СинонимМакета = НСтр("ka='Т-5 (Приказ о переводе)';ru='Т-5 (Приказ о переводе)';en='T-5 (transfer order)'");
		
		СформироватьКадровыйПриказ(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приказ_Т5";
	КомандаПечати.Представление = НСтр("ka='Т-5 (Приказ о переводе)';ru='Т-5 (Приказ о переводе)';en='T-5 (transfer order)'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
